---
kind: type
id: T:Autodesk.Revit.DB.ExportPatternTableIterator
source: html/1c08a52a-3648-fa5f-c4d2-d42177608496.htm
---
# Autodesk.Revit.DB.ExportPatternTableIterator

An iterator to a set of Pattern table.

## Syntax (C#)
```csharp
public class ExportPatternTableIterator : IEnumerator<KeyValuePair<ExportPatternKey, ExportPatternInfo>>
```